//==============================================================================
// Filename: CommonCamera.h
// Description: 抽象化レイヤー用共通カメラクラス
// Copyright (C) Silicon Studio Co.,Ltd.All rightsreserved.
//==============================================================================
#pragma once
#include "D3D12Camera.h"
#include "D3D11Camera.h"

class CommonCamera
{
public:
    //---------------------------------------------------------------------------

    //---------------------------------------------------------------------------


protected:

private:
    //---------------------------------------------------------------------------
    XMMATRIX m_pWorldMtx = {};
    XMMATRIX m_pViewMtx = {};
    XMMATRIX m_pProjMtx = {};
    //---------------------------------------------------------------------------
    /// <summary>
    /// m_pWorldMtx		ワールド変換行列（削除予定）
    /// m_pViewMtx	    ビュー変換行列
    /// m_pProjMtx		プロジェクション変換行列
    /// 
    /// </summary>
};

