//==============================================================================
// Filename: D3D12Render.h
// Description: DirectX12ObjDataの共通描画処理用クラス
// Copyright (C) Silicon Studio Co.,Ltd.All rightsreserved.
//==============================================================================

#pragma once
#include "D3D12Graphics.h"
#include "D3D12Camera.h"
class D3D12Render
{
public:
    //---------------------------------------------------------------------------

    //---------------------------------------------
    /// ルートシグネチャとパイプラインの初期化
    ///
    /// \return エラーが出た場合-1が、正常に終了した場合0が返される
    //--------------------------------------------- 
    int D3D12RenderInit();

    //---------------------------------------------
    /// D3D12ObjDataの描画前処理
    ///
    /// \return void
    //--------------------------------------------- 
    void D3D12RenderSet();

    //---------------------------------------------------------------------------

protected:

private:
    //---------------------------------------------------------------------------
    ComPtr<ID3D12RootSignature> m_pRootSignature;
    ComPtr<ID3D12PipelineState> m_pPipelineState;
    //---------------------------------------------------------------------------
    /// <summary>
    /// m_pRootSignature    ルートシグネチャ
    /// m_pPipelineState    グラフィックスパイプライン
    /// </summary>
};

