//==============================================================================
// Filename: ObjData.h
// Description: ポリゴン情報及び描画システム
// Copyright (C) Silicon Studio Co.,Ltd.All rightsreserved.
//==============================================================================
#pragma once

#include "D3D11Graphics.h"
#include <vector>

struct VertexData
{
    DirectX::XMFLOAT3 pos;
};

class ObjData
{
public:
    //---------------------------------------------------------------------------
    //---------------------------------------------
    /// 頂点情報の保存と頂点バッファの作成
    ///
    /// \param[in] (p_VData)    頂点情報配列
    /// \param[in] (vNum)       p_VDataの配列数
    ///
    /// \return エラーが出た場合-1が、正常に終了した場合0が返される
    //--------------------------------------------- 
    int ObjInit(
        /*[in]*/    const VertexData* p_VData,
        /*[in]*/    const int vNum);

    //---------------------------------------------
    /// 頂点情報を用いたDirectX11での描画処理
    ///
    /// \return 正常に終了した場合0が返される
    //--------------------------------------------- 
    int ObjDraw();

    //---------------------------------------------
    /// メンバ変数の解放処理
    ///
    /// \return 正常に終了した場合0が返される
    //--------------------------------------------- 
    int ObjUninit();

    //---------------------------------------------------------------------------


protected:

private:
    //---------------------------------------------------------------------------
    std::vector<VertexData> m_vertex;
    ComPtr<ID3D11Buffer> m_vertexBuff;
    //---------------------------------------------------------------------------
    /// <summary>
    /// m_vertex        頂点情報
    /// m_vertexBuff    頂点バッファ
    /// </summary>
};