//==============================================================================
// Filename: OpenGLGraphics.h
// Description: OpenGLの描画システム
// Copyright (C) Silicon Studio Co.,Ltd.All rightsreserved.
//==============================================================================
#pragma once
#pragma comment (lib,"opengl32.lib")
#pragma comment (lib,"glu32.lib")
#include <windows.h>

class OpenGLGraphics
{
public:
    //---------------------------------------------------------------------------
    //---------------------------------------------
    /// OpenGLの初期化関数
    ///
    /// \param[in] ( hWnd )         ウィンドウハンドル
    /// \param[in] ( width )        ウィンドウの幅
    /// \param[in] ( height )       ウィンドウの高さ 
    ///
    /// \return エラーの場合-1、正常に終了した場合0が返される
    //--------------------------------------------- 
    int OpenGLInit(
        /*[in]*/	const HWND hWnd,
        /*[in]*/	const int width,
        /*[in]*/	const int height);

    //---------------------------------------------
    /// OpenGLの描画事前処理
    ///
    /// \return エラーの場合-1、正常に終了した場合0が返される
    //--------------------------------------------- 
    int OpenGLBeforeRender();

    //---------------------------------------------
    /// OpenGLの描画事後処理
    ///
    /// \return エラーの場合-1、正常に終了した場合0が返される
    //--------------------------------------------- 
    int OpenGLAfterRender();

    //---------------------------------------------
    /// インスタンスの作成
    //--------------------------------------------- 
    static void CreateInstance();

    //---------------------------------------------
    /// インスタンスの削除
    //--------------------------------------------- 
    static void DeleteInstance();

    //---------------------------------------------
    /// インスタンスの取得
    /// 
    /// \return インスタンス
    //--------------------------------------------- 
    static OpenGLGraphics& GetInstance()
    {
        return *s_pInstance;
    }
    //---------------------------------------------------------------------------

    HGLRC gethglrc()
    {
        return m_RenderingContext;
    }
protected:

private:
    //---------------------------------------------------------------------------
    HDC m_DeviceContext;
    HGLRC m_RenderingContext;

    static inline OpenGLGraphics* s_pInstance;
    //---------------------------------------------------------------------------

};

