//==============================================================================
// Filename: OpenGLCamera.h
// Description: OpenGLのカメラ及びビュー変換行列の管理クラス、シングルトン
// Copyright (C) Silicon Studio Co.,Ltd.All rightsreserved.
//==============================================================================
#pragma once
#include "CommonCamera.h"
#include "OpenGLGraphics.h"
#include "gl/glu.h"


class OpenGLCamera
{
public:
    //---------------------------------------------------------------------------

    //---------------------------------------------
    /// カメラ情報の初期設定とビュー変換行列、プロジェクション変換行列の初期化
    ///
    /// \param[in] (eye)		カメラ位置
    /// \param[in] (lookat)     カメラの注視点
    /// \param[in] (up)		カメラの上方向
    ///
    /// \return エラーが出た場合-1が、正常に終了した場合0が返される
    //--------------------------------------------- 
    int CameraInit(
        /*[in]*/    const FLOAT3 eye,
        /*[in]*/    const FLOAT3 lookat,
        /*[in]*/    const FLOAT3 up);

    //---------------------------------------------
    /// インスタンスの作成
    /// 
    /// \return void
    //--------------------------------------------- 
    static void CreateInstance();

    //---------------------------------------------
    /// インスタンスの削除
    /// 
    /// \return void
    //--------------------------------------------- 
    static void DeleteInstance();

    //---------------------------------------------
    /// インスタンスの取得
    /// 
    /// \return インスタンス
    //--------------------------------------------- 
    static OpenGLCamera& GetInstance()
    {
        return *s_pInstance;
    }

    //---------------------------------------------------------------------------


protected:


private:
    //---------------------------------------------------------------------------


    static inline OpenGLCamera* s_pInstance;
    //---------------------------------------------------------------------------
    /// <summary>
    /// 
    /// s_pInstance      インスタンス
    /// </summary>
};

